{"_id":{"$oid":"61b7b6539e5dd227cf994e95"},"Title":"Silence of the Lambs","Description":"A young FBI cadet must retrieve the help of an incarcerated and manipulative cannibal killer to help catch another serial killer.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Johnathan Demme","Bio":"Robert Johnathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":true}
{"_id":{"$oid":"61b9a923ed2b209a05b19fcb"},"Title":"Akira","Description":"A young man is given psychic powers and goes on a rampage to find the truth of the universe.","Genre":{"Name":"Science Fiction","Description":"Science fiction is a genre of speculative fiction that typically deals with imaginative and futuristic concepts such as advanced science and technology."},"Director":{"Name":"Katsuhiro Otomo","Bio":"Katsuhiro Otomo is a Japanese manga artist, screenwriter, animator and film director. He is best known as the creator of Akira, in terms of both the original 1982 manga series and the 1988 animated film adaptation.","Birth":"1954","Death":""},"ImagePath":"https://www.imdb.com/title/tt0094625/mediaviewer/rm2245203200/","Featured":true}
{"_id":{"$oid":"61b9aaa0ed2b209a05b19fcc"},"Title":"Ponyo","Description":"When young boy named Sosuke rescues a goldfish named Ponyo, they embark on a fantastic journey of friendship before Ponyo's father forces her to return to the sea.","Genre":{"Name":"Fantasy","Description":"Fantasy films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds."},"Director":{"Name":"Hayao Miyazaki","Bio":" UPDATE - Hayao Miyazaki Is a Japanese animated film director and is one of the most accomplished directors of all time.","Birth":"1941","Death":""},"ImagePath":"https://www.imdb.com/title/tt0876563/mediaviewer/rm4240732928/","Featured":true}
{"_id":{"$oid":"61b9ab46ed2b209a05b19fcd"},"Title":"Spiried Away","Description":"Spirited Away tells the story of Chihiro Ogino (Hiiragi), a ten-year-old girl who, while moving to a new neighborhood, enters the world of Kami (spirits of Japanese Shinto folklore).","Genre":{"Name":"Fantasy","Description":"Fantasy films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds."},"Director":{"Name":"Hayao Miyazaki","Bio":" UPDATE - Hayao Miyazaki Is a Japanese animated film director and is one of the most accomplished directors of all time.","Birth":"1941","Death":""},"ImagePath":"https://www.imdb.com/title/tt0245429/mediaviewer/rm4207852801/","Featured":true}
{"_id":{"$oid":"61b9be75ed2b209a05b19fce"},"Title":"Blade Runner","Description":"Blade Runner is set in a dystopian future Los Angeles of 2019, in which synthetic humans known as replicants are bio-engineered by the powerful Tyrell Corporation to work on space colonies. When a fugitive group of advanced replicants led by Roy Batty escapes back to Earth, The burnt-out cop Rick Deckard reluctantly agrees to hunt them down.","Genre":{"Name":"Cyberpunk","Description":"Cyberpunk is a subgenre of science fiction in a dystopian futuristic setting that tends to focus on a 'combination of lowlife and high tech' featuring advanced technological and scientific achievements, such as artificial intelligence and cybernetics, juxtaposed with a degree of breakdown or radical change in the social order."},"Director":{"Name":"Ridley Scott","Bio":"Sir Ridley Scott is an English film director and producer. He has directed the science fiction horror film Alien (1979), the neo-noir dystopian film Blade Runner (1982), the road adventure film Thelma & Louise (1991), the historical drama film Gladiator (2000), the war film Black Hawk Down (2001), and the science fiction film The Martian (2015).","Birth":"1937","Death":""},"ImagePath":"https://www.imdb.com/title/tt0083658/mediaviewer/rm3676975360/","Featured":true}
{"_id":{"$oid":"61b9bedded2b209a05b19fcf"},"Title":"The Secret of NIMH","Description":"To save her ill son, a field mouse must seek the aid of a colony of rats, with whom she has a deeper link than she ever suspected.","Genre":{"Name":"Fantasy","Description":"Fantasy films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds."},"Director":{"Name":"Don Bluth","Bio":"Don Bluth was one of the chief animators at Disney to come to the mantle after the great one's death. He eventually became the animation director for such films as The Rescuers (1977) and Pete's Dragon (1977).","Birth":"1937","Death":""},"ImagePath":"https://www.imdb.com/title/tt0084649/mediaviewer/rm2704111872/","Featured":true}
{"_id":{"$oid":"61b9bf13ed2b209a05b19fd0"},"Title":"Coco","Description":"Aspiring musician Miguel, confronted with his family's ancestral ban on music, enters the Land of the Dead to find his great-great-grandfather, a legendary singer.","Genre":{"Name":"Musical","Description":"Musical film is a film genre in which songs by the characters are interwoven into the narrative, sometimes accompanied by singing and dancing."},"Director":{"Name":"Lee Unkrich","Bio":"Lee Edward Unkrich is an American director, film editor, screenwriter, and animator. He was a longtime member of the creative team at Pixar, where he started in 1994 as a film editor. He later began directing, first as co-director of Toy Story 2.","Birth":"1967","Death":""},"ImagePath":"https://www.imdb.com/title/tt2380307/mediaviewer/rm585455872/","Featured":true}
{"_id":{"$oid":"61b9bf3ced2b209a05b19fd1"},"Title":"Dune","Description":"Feature adaptation of Frank Herbert's science fiction novel about the son of a noble family entrusted with the protection of the most valuable asset and most vital element in the galaxy.","Genre":{"Name":"Science Fiction","Description":"Science fiction (or sci-fi) is a film genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, spacecraft, robots, cyborgs, interstellar travel or other technologies."},"Director":{"Name":"Denis Villeneuve","Bio":"Denis Villeneuve is a French Canadian film director and writer. He was born in 1967, in Trois-Rivières, Québec, Canada. He started his career as a filmmaker at the National Film Board of Canada.","Birth":"1967","Death":""},"ImagePath":"https://www.imdb.com/title/tt1160419/mediaviewer/rm2910452737/","Featured":true}
{"_id":{"$oid":"61b9bf79ed2b209a05b19fd2"},"Title":"Shang-Chi and the Legend of the Ten Rings","Description":"Shang-Chi, the master of weaponry-based Kung Fu, is forced to confront his past after being drawn into the Ten Rings organization.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist or protagonists are thrust into a series of events that typically include violence, extended fighting, physical feats, rescues and frantic chases."},"Director":{"Name":"Destin Daniel Cretton","Bio":"Destin Daniel Cretton is an American filmmaker. He is best known for his films Short Term 12 (2013), The Glass Castle (2017), Just Mercy (2019), as well as the Marvel Studios film Shang-Chi and the Legend of the Ten Rings (2021).","Birth":"1978","Death":""},"ImagePath":"https://www.imdb.com/title/tt9376612/mediaviewer/rm4274650881/","Featured":true}
{"_id":{"$oid":"61b9bf98ed2b209a05b19fd3"},"Title":"Independence Day","Description":"The aliens are coming and their goal is to invade and destroy Earth. Fighting superior technology, mankind's best weapon is the will to survive.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist or protagonists are thrust into a series of events that typically include violence, extended fighting, physical feats, rescues and frantic chases."},"Director":{"Name":"Roland Emmerich","Bio":"Roland Emmerich is a German film director and producer of blockbuster films like The Day After Tomorrow (2004), Godzilla (1998), Independence Day (1996) and The Patriot (2000).","Birth":"1955","Death":""},"ImagePath":"https://www.imdb.com/title/tt0116629/mediaviewer/rm2203522816/","Featured":true}
{"_id":{"$oid":"61b9bfbced2b209a05b19fd4"},"Title":"Tokyo Godfathers","Description":"On Christmas Eve, three homeless people living on the streets of Tokyo discover a newborn baby among the trash and set out to find its parents.","Genre":{"Name":"Action","Description":"Adventure film is a genre that revolves around the conquests and explorations of a protagonist. The purpose of the conquest can be to retrieve a person or treasure, but often the main focus is simply the pursuit of the unknown. These films generally take place in exotic locations and play on historical myths."},"Director":{"Name":"Satoshi Kon","Bio":"Satoshi Kon (今 敏, Kon Satoshi, October 12, 1963 – August 24, 2010) was a Japanese film director, animator, screenwriter and manga artist from Sapporo, Hokkaidō and a member of the Japanese Animation Creators Association (JAniCA).","Birth":"1963","Death":"2010"},"ImagePath":"https://www.imdb.com/title/tt0388473/mediaviewer/rm1556796929/","Featured":true}
